# Joins in SQL

In [1]:
load_ext sql

In [10]:
learning_db = f'postgresql://postgres:SANket147@localhost/Learning'

In [59]:
%sql drop table personal_details

 * postgresql://postgres:***@localhost/Learning
Done.

[]

In [60]:
%%sql $learning_db
-- DROP TABLE personal_details;

-- Create Personal details table
create table personal_details(
    id INTEGER PRIMARY KEY NOT NULL,
    f_name VARCHAR(20) NOT NULL,
    l_name VARCHAR(20) NOT NULL,
    phone varchar(20) NOT NULL,
    address integer not null
    
);

-- Insert Values into table

SELECT * FROM personal_details;
INSERT INTO personal_details
    (id , f_name ,l_name, phone, address)
VALUES
    (1, 'Sanket', 'Wagh', '9762151814',1),
    (2, 'Sukanya', 'Wagh', '9762151815',2),
    (3, 'Utsav', 'Bhowmik', '9762151816',4),
    (4, 'Aditya', 'Jamdade', '9762151817',3),
    (5, 'Utssav', 'Bhowmik', '9762151818',8)

Done.
0 rows affected.
5 rows affected.

[]

In [44]:
%sql select * from personal_details

 * postgresql://postgres:***@localhost/Learning
5 rows affected.

[(1, 'Sanket', 'Wagh', '9762151814', 1),
 (2, 'Sukanya', 'Wagh', '9762151815', 2),
 (3, 'Utsav', 'Bhowmik', '9762151816', 4),
 (4, 'Aditya', 'Jamdade', '9762151817', 3),
 (5, 'Utssav', 'Bhowmik', '9762151818', 8)]

In [19]:
%sql select * from address limit 1

 * postgresql://postgres:***@localhost/Learning
(psycopg2.errors.UndefinedTable) relation "address" does not exist
LINE 1: select * from address limit 1
                      ^

[SQL: select * from address limit 1]
(Background on this error at: http://sqlalche.me/e/f405)

In [36]:
%sql drop table address

 * postgresql://postgres:***@localhost/Learning
Done.

[]

In [37]:
%%sql
create table address(
    id_a INTEGER PRIMARY KEY NOT NULL,
    city VARCHAR(20) NOT NULL,
    state VARCHAR(20) NOT NULL,
    pin varchar(20) NOT NULL
);

-- Insert Values into table

SELECT * FROM address;
INSERT INTO address
    (id_a , city ,state, pin)
VALUES
    (1, 'Baramati', 'Maharashtra', '411002'),
    (2, 'Pune', 'Maharashtra', '411008'),
    (3, 'Kolkata', 'West Bengal', '888888'),
    (4, 'Mumbai', 'Maharashtra', '127887'),
    (5, 'Patna', 'Bihar', '123455')

 * postgresql://postgres:***@localhost/Learning
Done.
0 rows affected.
5 rows affected.

[]

In [66]:
%sql select * from personal_details

 * postgresql://postgres:***@localhost/Learning
6 rows affected.

[(1, 'Sanket', 'Wagh', '9762151814', 1),
 (2, 'Sukanya', 'Wagh', '9762151815', 2),
 (3, 'Utsav', 'Bhowmik', '9762151816', 4),
 (4, 'Aditya', 'Jamdade', '9762151817', 3),
 (5, 'Utssav', 'Bhowmik', '9762151818', 8),
 (6, 'idli', 'sambhar', '2414134124', 9)]

In [45]:
%sql select * from address

 * postgresql://postgres:***@localhost/Learning
5 rows affected.

[(1, 'Baramati', 'Maharashtra', '411002'),
 (2, 'Pune', 'Maharashtra', '411008'),
 (3, 'Kolkata', 'West Bengal', '888888'),
 (4, 'Mumbai', 'Maharashtra', '127887'),
 (5, 'Patna', 'Bihar', '123455')]

In [ ]:
# Left Outer Join

In [67]:
%%sql
select A.f_name, A.l_name, B.city, B.state, B.pin
from personal_details as A
LEFT OUTER JOIN address as B
on A.address = B.id_a

 * postgresql://postgres:***@localhost/Learning
6 rows affected.

[('Sanket', 'Wagh', 'Baramati', 'Maharashtra', '411002'),
 ('Sukanya', 'Wagh', 'Pune', 'Maharashtra', '411008'),
 ('Utsav', 'Bhowmik', 'Mumbai', 'Maharashtra', '127887'),
 ('Aditya', 'Jamdade', 'Kolkata', 'West Bengal', '888888'),
 ('Utssav', 'Bhowmik', None, None, None),
 ('idli', 'sambhar', None, None, None)]

In [ ]:
## Right Outer Join

In [65]:
%%sql
select A.f_name, A.l_name, B.city, B.state, B.pin
from personal_details as A
RIGHT OUTER JOIN address as B
on A.address = B.id_a

 * postgresql://postgres:***@localhost/Learning
5 rows affected.

[('Sanket', 'Wagh', 'Baramati', 'Maharashtra', '411002'),
 ('Sukanya', 'Wagh', 'Pune', 'Maharashtra', '411008'),
 ('Utsav', 'Bhowmik', 'Mumbai', 'Maharashtra', '127887'),
 ('Aditya', 'Jamdade', 'Kolkata', 'West Bengal', '888888'),
 (None, None, 'Patna', 'Bihar', '123455')]

In [ ]:
## Inner Join

In [63]:
%%sql
select A.f_name, A.l_name, B.city, B.state, B.pin
from personal_details as A
INNER JOIN address as B
on A.address = B.id_a

 * postgresql://postgres:***@localhost/Learning
4 rows affected.

[('Sanket', 'Wagh', 'Baramati', 'Maharashtra', '411002'),
 ('Sukanya', 'Wagh', 'Pune', 'Maharashtra', '411008'),
 ('Utsav', 'Bhowmik', 'Mumbai', 'Maharashtra', '127887'),
 ('Aditya', 'Jamdade', 'Kolkata', 'West Bengal', '888888')]

In [61]:
%%sql insert into personal_details
values
(6, 'idli', 'sambhar', '2414134124',9)

 * postgresql://postgres:***@localhost/Learning
1 rows affected.

[]

In [62]:
%sql select * from personal_details

 * postgresql://postgres:***@localhost/Learning
6 rows affected.

[(1, 'Sanket', 'Wagh', '9762151814', 1),
 (2, 'Sukanya', 'Wagh', '9762151815', 2),
 (3, 'Utsav', 'Bhowmik', '9762151816', 4),
 (4, 'Aditya', 'Jamdade', '9762151817', 3),
 (5, 'Utssav', 'Bhowmik', '9762151818', 8),
 (6, 'idli', 'sambhar', '2414134124', 9)]

In [68]:
%%sql
select A.f_name, A.l_name, B.city, B.state, B.pin
from personal_details as A
FULL OUTER JOIN address as B
on A.address = B.id_a

 * postgresql://postgres:***@localhost/Learning
7 rows affected.

[('Sanket', 'Wagh', 'Baramati', 'Maharashtra', '411002'),
 ('Sukanya', 'Wagh', 'Pune', 'Maharashtra', '411008'),
 ('Utsav', 'Bhowmik', 'Mumbai', 'Maharashtra', '127887'),
 ('Aditya', 'Jamdade', 'Kolkata', 'West Bengal', '888888'),
 ('Utssav', 'Bhowmik', None, None, None),
 ('idli', 'sambhar', None, None, None),
 (None, None, 'Patna', 'Bihar', '123455')]

# Self Joins

In [73]:
e

 * postgresql://postgres:***@localhost/Learning
6 rows affected.

[('Sanket', 'Sanket'),
 ('Sukanya', 'Sukanya'),
 ('Utsav', 'Utsav'),
 ('Aditya', 'Aditya'),
 ('Utssav', 'Utssav'),
 ('idli', 'idli')]